doc/nix-language.org
#+title: The Nix Language
#+setupfile: internal/links.org

* Org-mode setup :noexport:

#+name: cleanup
#+begin_src sh :dir .. :results output silent :noweb yes
rm --recursive --force nix_example
#+end_src

* About this document

This document is a quick introduction to the Nix programming language.

You can use the [[nix][Nix]] command-line tools without understanding the programming
language (also called Nix). However, learning the Nix language, will allow you
to develop your own Nix packages and read the source code of others. A lot of
this code is in [[nixpkgs][Nixpkgs]], a centralized repository of Nix code for the entire Nix
ecosystem.

The Nix community has recently developed [[nix-language-tutorial][a tutorial for the language]], which may
be a good alternative or supplement to this document.

This document is no substitute for the [[nix-language-manual][official Nix language documentation]],
which is not that long for a programming language. Nix does not have much syntax
relative to other general-purpose programming languages.

* Prerequisites

You can read this document without following along on your own computer.

If you do want to follow along, you need to [[file:nix-installation.org][install Nix]]. When installing Nix you
will need to have the =nix-command= experimental feature enabled to follow along
with this document. You won't need =flakes= enabled, though.

* Primitive literals

We can play around with the Nix language with the =nix eval= command. As with
many languages, we can use Nix as a simple calculator by passing Nix expressions
to it:

#+begin_src sh :results output :exports both
nix eval --expr '1 + 1'
#+end_src

#+RESULTS:
: 2

Note, we just have to quote our entire expression for a shell invocation. For an
interactive session where this quoting isn't needed, you can use the =nix repl=
command.

Nix supports a variety of types you'd expect for a programming language, and we
get some literal syntax for typical primitives:

#+begin_src sh :results output :exports both
nix eval --expr 'builtins.typeOf 1'
nix eval --expr 'builtins.typeOf 1.0'
nix eval --expr 'builtins.typeOf true'
#+end_src

#+RESULTS:
: "int"
: "float"
: "bool"

Though not covered here in great detail, primitives support the typical
operations one would expect. For instance, we have =||=, =&&=, and =!= for
boolean values. Numeric values have typical arithmetic operators of =+=, =-=,
=/=, and =*=. And we can compare all values with ====.

* Strings

As you may expect from other languages, Nix supports string literals with the
conventional double quote syntax:

#+begin_src sh :results output :exports both
nix eval --expr 'builtins.typeOf "hello"'
#+end_src

#+RESULTS:
: "string"

Nix also supports multi-line strings with two consecutive single quotes:

#+begin_src sh :results output :exports both
nix eval --expr "''
      line 1
        line 2
    line 3 ''"
#+end_src

#+RESULTS:
: "  line 1\n    line 2\nline 3 "

The left-most token in any line establishes a left margin. In the example above,
this is ~line 3~. Beyond these strings, Nix does not have syntactically
significant whitespace.

We concatenate strings with the =+= operator:

#+begin_src sh :results output :exports both
nix eval --expr '"a" + "b"'
#+end_src

#+RESULTS:
: "ab"

* Let-expressions

Because of Nix's foundation as a “functional” programming language, you can't
repeatedly bind values to variables as you may in other “imperative” languages.
When we bind a value to a name, it's permanently bound for the entire scope the
name exists within. We manage these scopes of bound names with
/let-expressions/:

#+begin_src sh :results output :exports both
nix eval --expr 'let a = 1; b = 2; in a + b'
#+end_src

#+RESULTS:
: 3

In this example, we've bound =a= to 1, and =b= to 2, but only for the scope of
the expression that follows the =in= keyword, =a + b=.

As illustrated below, we can't rebind a name:

#+begin_src sh :results output :exports both
nix eval --expr 'let a = 1; a = 2; in a' 2>&1 || true
#+end_src

#+RESULTS:
: error: attribute 'a' already defined at «string»:1:5
: 
:        at «string»:1:12:
: 
:             1| let a = 1; a = 2;
:              |            ^

Note that semicolons are mandatory in all Nix forms that have them, including
let-expressions. Because of Nix's strict parsing you can neither elide
semicolons, nor put extra ones.

* String interpolation

Sometimes we build up small code snippets inline in a Nix expression, so it's
useful to have string interpolation support. Similar to shell scripting, the
syntax for this follows:

#+begin_src sh :results output :exports both
nix eval --expr '
    let foo = "Foo";
        bar = "Bar";
    in "${foo + bar} is a terrible name"'
#+end_src

#+RESULTS:
: "FooBar is a terrible name"

String interpolation is supported by both normal and multi-line strings.

You can only interpolate strings into strings. For instance, interpolating an
integer won't work:

#+begin_src sh :results output :exports both
nix eval --expr '
    let a_number = 42;
    in "${a_number} is a terrible number"' 2>&1 || true
#+end_src

#+RESULTS:
#+begin_example
error:
       … while evaluating a path segment

         at «string»:3:9:

            2|     let a_number = 42;
            3|     in "${a_number} is a terrible number"
             |         ^

       error: cannot coerce an integer to a string
#+end_example

We can use a builtin =toString= function to coerce types to strings:

#+begin_src sh :results output :exports both
nix eval --expr '
    let a_number = 42;
    in "${builtins.toString a_number} is a terrible number"' 2>&1 || true
#+end_src

#+RESULTS:
: "42 is a terrible number"

Note that unlike shell scripts, the curly braces are not optional for string
interpolation in Nix. This works out in our favor if we're writing shell scripts
inline in a Nix expression, because we can use ~$name~ for shell string
interpolation and ~${nix_expr}~ for Nix string interpolation. If this is not
enough, within multiline strings, we can suppress interpolation with by using
=''${…}= instead of just =${…}=.

This is a little tedious to illustrate in a shell example without dealing with
quote delimiting. In the following example, the shell will interpolate, but not
the final Nix expression because we have =''$= instead of just =$= in our final
string:

#+begin_src sh :results output :exports both
FROM_SHELL='${NOT_EXPANDED_BY_NIX}'
nix eval --expr "''In ''$FROM_SHELL expansion is prevented.''"
#+end_src

#+RESULTS:
: "In \${NOT_EXPANDED_BY_NIX} expansion is prevented."

Here's the same example without the suppression of the interpolation:

#+begin_src sh :results output :exports both
FROM_SHELL='${EXPANDED_BY_NIX}'
nix eval --expr "''In $FROM_SHELL expansion still happens.''" 2>&1 || true
#+end_src

#+RESULTS:
: error: undefined variable 'EXPANDED_BY_NIX'
: 
:        at «string»:1:8:
: 
:             1| ''In ${EXPANDED_BY_NIX} expansion still happens.''
:              |        ^

* Functions

Nix has first class functions. Nix's functions take in only one argument at a
time, and use a colon to separate the parameter name from the body of the
function. Furthermore, Nix uses whitespace for function application:

#+begin_src sh :results output :exports both
nix eval --expr 'builtins.typeOf (a: a + 1)'
nix eval --expr '(a: a + 1) 2'
#+end_src

#+RESULTS:
: "lambda"
: 3

Since functions take only one argument at a time, we encode n-ary functions with
functions returning functions:

#+begin_src sh :results output :exports both
nix eval --expr '(a: b: a + b) 1 2'
#+end_src

#+RESULTS:
: 3

In this case, when we apply ~1~ to ~a: b: a + b~, we get another function. When
we apply ~2~ to this resultant function, we finally get our answer ~3~.

If you've heard of /currying a function/ in other languages with n-ary
functions, you may recognize this technique.

