doc/nix-language.md
- [About this document](#sec-1)
- [Prerequisites](#sec-2)
- [Primitive literals](#sec-3)
- [Strings](#sec-4)
- [Let-expressions](#sec-5)
- [String interpolation](#sec-6)
- [Functions](#sec-7)
- [Lists](#sec-8)
- [Attribute sets](#sec-9)
- [Paths](#sec-10)
- [Mutable (dangerous) path references](#sec-11)
- [Other (mutable) dangers](#sec-12)
- [Importing](#sec-13)


# About this document<a id="sec-1"></a>

This document is a quick introduction to the Nix programming language.

You can use the [Nix](https://nixos.org/nix) command-line tools without understanding the programming language (also called Nix). However, learning the Nix language, will allow you to develop your own Nix packages and read the source code of others. A lot of this code is in [Nixpkgs](https://github.com/NixOS/nixpkgs), a centralized repository of Nix code for the entire Nix ecosystem.

The Nix community has recently developed [a tutorial for the language](https://nixos.org/guides/nix-language.html), which may be a good alternative or supplement to this document.

This document is no substitute for the [official Nix language documentation](https://nixos.org/manual/nix/stable/language/index.html), which is not that long for a programming language. Nix does not have much syntax relative to other general-purpose programming languages.

# Prerequisites<a id="sec-2"></a>

You can read this document without following along on your own computer.

If you do want to follow along, you need to [install Nix](nix-installation.md). When installing Nix you will need to have the `nix-command` experimental feature enabled to follow along with this document. You won't need `flakes` enabled, though.

# Primitive literals<a id="sec-3"></a>

We can play around with the Nix language with the `nix eval` command. As with many languages, we can use Nix as a simple calculator by passing Nix expressions to it:

```sh
nix eval --expr '1 + 1'
```

    2

Note, we just have to quote our entire expression for a shell invocation. For an interactive session where this quoting isn't needed, you can use the `nix repl` command.

Nix supports a variety of types you'd expect for a programming language, and we get some literal syntax for typical primitives:

```sh
nix eval --expr 'builtins.typeOf 1'
nix eval --expr 'builtins.typeOf 1.0'
nix eval --expr 'builtins.typeOf true'
```

    "int"
    "float"
    "bool"

Though not covered here in great detail, primitives support the typical operations one would expect. For instance, we have `||`, `&&`, and `!` for boolean values. Numeric values have typical arithmetic operators of `+`, `-`, `/`, and `*`. And we can compare all values with `==`.

# Strings<a id="sec-4"></a>

As you may expect from other languages, Nix supports string literals with the conventional double quote syntax:

```sh
nix eval --expr 'builtins.typeOf "hello"'
```

    "string"

Nix also supports multi-line strings with two consecutive single quotes:

```sh
nix eval --expr "''
      line 1
	line 2
    line 3 ''"
```

    "  line 1\n    line 2\nline 3 "

The left-most token in any line establishes a left margin. In the example above, this is `line 3`. Beyond these strings, Nix does not have syntactically significant whitespace.

We concatenate strings with the `+` operator:

```sh
nix eval --expr '"a" + "b"'
```

    "ab"

# Let-expressions<a id="sec-5"></a>

Because of Nix's foundation as a “functional” programming language, you can't repeatedly bind values to variables as you may in other “imperative” languages. When we bind a value to a name, it's permanently bound for the entire scope the name exists within. We manage these scopes of bound names with *let-expressions*:

```sh
nix eval --expr 'let a = 1; b = 2; in a + b'
```

    3

In this example, we've bound `a` to 1, and `b` to 2, but only for the scope of the expression that follows the `in` keyword, `a + b`.

As illustrated below, we can't rebind a name:

```sh
nix eval --expr 'let a = 1; a = 2; in a' 2>&1 || true
```

    error: attribute 'a' already defined at «string»:1:5
    
           at «string»:1:12:
    
                1| let a = 1; a = 2;
                 |            ^

Note that semicolons are mandatory in all Nix forms that have them, including let-expressions. Because of Nix's strict parsing you can neither elide semicolons, nor put extra ones.

# String interpolation<a id="sec-6"></a>

Sometimes we build up small code snippets inline in a Nix expression, so it's useful to have string interpolation support. Similar to shell scripting, the syntax for this follows:

```sh
nix eval --expr '
    let foo = "Foo";
	bar = "Bar";
    in "${foo + bar} is a terrible name"'
```

    "FooBar is a terrible name"

String interpolation is supported by both normal and multi-line strings.

You can only interpolate strings into strings. For instance, interpolating an integer won't work:

```sh
nix eval --expr '
    let a_number = 42;
    in "${a_number} is a terrible number"' 2>&1 || true
```

    error:
           … while evaluating a path segment
    
             at «string»:3:9:
    
                2|     let a_number = 42;
                3|     in "${a_number} is a terrible number"
                 |         ^
    
           error: cannot coerce an integer to a string

We can use a builtin `toString` function to coerce types to strings:

```sh
nix eval --expr '
    let a_number = 42;
    in "${builtins.toString a_number} is a terrible number"' 2>&1 || true
```

    "42 is a terrible number"

Note that unlike shell scripts, the curly braces are not optional for string interpolation in Nix. This works out in our favor if we're writing shell scripts inline in a Nix expression, because we can use `$name` for shell string interpolation and `${nix_expr}` for Nix string interpolation. If this is not enough, within multiline strings, we can suppress interpolation with by using `''${…}` instead of just `${…}`.

This is a little tedious to illustrate in a shell example without dealing with quote delimiting. In the following example, the shell will interpolate, but not the final Nix expression because we have `''$` instead of just `$` in our final string:

```sh
FROM_SHELL='${NOT_EXPANDED_BY_NIX}'
nix eval --expr "''In ''$FROM_SHELL expansion is prevented.''"
```

    "In \${NOT_EXPANDED_BY_NIX} expansion is prevented."

Here's the same example without the suppression of the interpolation:

```sh
FROM_SHELL='${EXPANDED_BY_NIX}'
nix eval --expr "''In $FROM_SHELL expansion still happens.''" 2>&1 || true
```

    error: undefined variable 'EXPANDED_BY_NIX'
    
           at «string»:1:8:
    
                1| ''In ${EXPANDED_BY_NIX} expansion still happens.''
                 |        ^

# Functions<a id="sec-7"></a>

Nix has first class functions. Nix's functions take in only one argument at a time, and use a colon to separate the parameter name from the body of the function. Furthermore, Nix uses whitespace for function application:

```sh
nix eval --expr 'builtins.typeOf (a: a + 1)'
nix eval --expr '(a: a + 1) 2'
```

    "lambda"
    3

Since functions take only one argument at a time, we encode n-ary functions with functions returning functions:

```sh
nix eval --expr '(a: b: a + b) 1 2'
```

    3

In this case, when we apply `1` to `a: b: a + b`, we get another function. When we apply `2` to this resultant function, we finally get our answer `3`.

If you've heard of *currying a function* in other languages with n-ary functions, you may recognize this technique.
