doc/nix-language.md

# Lists<a id="sec-8"></a>

Nix also has list literals, which use square brackets and are whitespace-delimited:

```sh
nix eval --expr 'builtins.typeOf [1 2 3 4 5]'
```

    "list"

We can append lists together with the `++` operator:

```sh
nix eval --expr '[1 2] ++ [3 4]'
```

    [ 1 2 3 4 ]

The elements of a list in Nix do not have to be the same type, and lists can be nested:

```sh
nix eval --expr '[1 "hello" [true]]'
```

    [ 1 "hello" [ true ] ]

# Attribute sets<a id="sec-9"></a>

Very importantly, Nix has a kind of map called an *attribute set* that is specialized to have textual indices called *attributes* that index values of arbitrary types. It uses the following syntax:

```sh
nix eval --expr 'builtins.typeOf { a = 1; b = 2; }'
nix eval --expr '{ a = 1; b = 2; }'
nix eval --expr '{ a = 1; b = 2; }.b'
```

    "set"
    { a = 1; b = 2; }
    2

Note, `builtins` is just an attribute set that is in scope by default. And `typeOf` is just an attribute that maps to a function that returns a string indicating the type of the argument.

Often used in Nix expressions, we can overlay sets on top of each other with the `//` operator:

```sh
nix eval --expr '{ a = 1; b = 2; } // { b = 3; c = 4; }'
```

    { a = 1; b = 3; c = 4; }

Additionally, we can prefix set literals with the `rec` keyword to get recursive sets. Recursive sets allow values in a set to reference attributes by name:

```sh
nix eval --expr 'rec { a = b; b = 2; }.a'
```

    2

Without the `rec` keyword, we'd get an error:

```sh
nix eval --expr '{ a = b; b = 2; }.a' 2>&1 || true
```

    error: undefined variable 'b'
    
           at «string»:1:7:
    
                1| { a = b; b = 2; }.a
                 |       ^

If a function accepts an attribute set as an argument, we can have Nix destructure the set as a convenience with the following pattern syntax:

```sh
nix eval --expr '({ a, b }: a + b ) { a = 1; b = 2; }'
```

    3

This basic pattern syntax is rigid, and we can't pass in a attribute set with attributes that don't match the pattern:

```sh
nix eval --expr '({ a }: a + 2 ) { a = 3; b = 4; }' 2>&1 || true
```

    error:
           … from call site
    
             at «string»:1:1:
    
                1| ({ a }: a + 2 ) { a = 3; b = 4; }
                 | ^
    
           error: function 'anonymous lambda' called with unexpected argument 'b'
    
           at «string»:1:2:
    
                1| ({ a }: a + 2 ) { a = 3; b = 4; }
                 |  ^
           Did you mean a?

If we want to relax the destructuring to accept sets with other attributes we can use a “&#x2026;” form:

```sh
nix eval --expr '({ a, ...}: a + 2 ) { a = 3; b = 4; }'
```

    5

When destructuring, we can still bind the whole set to a name if we want to using a “@” form.

```sh
nix eval --expr '(s@{ a, b }: a + s.b ) { a = 2; b = 3; }'
```

    5

Attribute sets also support an additional syntactic convenience when pulling in locally bound values as attributes, which comes up a lot in Nix. For example, consider the way we're using `a = a` here:

```sh
nix eval --expr 'let a = 3; in { a = a; }'
```

    { a = 3; }

Rather than worrying about spelling the same name correctly both sides of the ‘=’ for an attribute setting, we can use the `inherit` keyword:

```sh
nix eval --expr 'let a = 3; in { inherit a; }'
```

    { a = 3; }

# Paths<a id="sec-10"></a>

Because the Nix language was designed for building packages, file paths come up frequently in Nix expressions. Nix conveniently has a *path* type, indicated by identifiers with at least one slash:

```sh
nix eval --expr 'builtins.typeOf /some/filepath'
nix eval --expr '/some/filepath'
```

    "path"
    /some/filepath

# Mutable (dangerous) path references<a id="sec-11"></a>

> **WARNING:** This section discusses a language feature of Nix that should be avoided in Nix expressions. Use of this feature can lead to subtle build breakages depending on how you've set the `NIX_PATH` environment variable. This section is included only to explain the feature if you encounter it in other's code.

Up until now, all the Nix expressions we've seen have been purely deterministic. `1 + 1` will always evaluate to `2`. This is a valuable property for a build tool. If a Nix expression describes how to build a package, we want to build it consistently every time.

Unfortunately, Nix has a special environment variable `NIX_PATH` which can provide mutable path references. For expressions that use the syntax described in this section, Nix expressions may reference paths that could change dynamically based on how `NIX_PATH` has been set. Builds relying on this are intrinsically non-deterministic.

`NIX_PATH` is a legacy environment variable, that the ecosystem is slowly working to phase out. To assist with this, the `nix` command requires an `--impure` switch to evaluate an expressions that access mutable paths.

As with `PATH`, the settings within `NIX_PATH` are colon-delimited, with earlier settings taking precedence over later ones. There are two forms for setting `NIX_PATH`:

-   `<name>=<filepath>`
-   `<directory>`

In a Nix expression, we can use an angle bracket syntax to search `NIX_PATH` for an existent file path. Here's an example of using `NIX_PATH` to set the name “temporary” to `/tmp`, which we then access with `<temporary>`:

```sh
NIX_PATH=temporary=/tmp nix eval --impure --expr '<temporary>'
```

    /tmp

If we create some files or folders there:

```sh
mkdir --parents /tmp/some.d/path
```

Then we can access them using our name as a path prefix in our angle brackets:

```sh
NIX_PATH=temporary=/tmp nix eval --impure --expr '<temporary/some.d/path>'
```

    /tmp/some.d/path

If we use the second form for `NIX_PATH`, can specify directories without a name. These directories are then used as candidate prefixes until an existent path if found. For example, we can consider `/tmp` as a path prefix when looking up `some.d/path` to find `/tmp/some.d/path`:

```sh
NIX_PATH=/tmp nix eval --impure --expr '<some.d/path>'
```

    /tmp/some.d/path

Now you know about the angle bracket syntax, but please never use it. It's generally caused the Nix community grief. The Nix community looks bad when a build system advertising deterministic builds fails to do so. There's almost always a better way to accomplish what you might with mutable path references.

# Other (mutable) dangers<a id="sec-12"></a>

There's other ways to have mutable references in Nix, but the angle notation discussed in the prior section is the most common found across various projects and legacy documentation.

For instance, it's possible to use some functions found on the `builtins` set to fetch files from the internet. Here's one such example:

```sh
nix eval --impure --expr '
    builtins.fetchGit {
	url = "https://github.com/NixOS/patchelf";
    }
'
```

    {
      lastModified = 1695801302;
      lastModifiedDate = "20230927075502";
      narHash = "sha256-pP/DBhsYFpYQ7RqB4+1Iy9B1jPlC1rNT3aZhhr1Z9EU=";
      outPath = "/nix/store/i0rgmq3dd0407n5b3jxkvs60gw3qpz1d-source";
      rev = "917ea45b79de04f69059f42a8e2621f7caeae1c9";
      revCount = 842;
      shortRev = "917ea45";
      submodules = false;
    }

Notice that because we're referencing a URL on the internet that might change `nix eval` forces us to use the `--impure` switch to perform this evaluation.

In general, exercise caution any time calling a nix command with `--impure`.
