doc/nix-language.org
* Importing

We can import paths. If the path is a file, it's loaded as a Nix expression. If
it's a directory, a file called “default.nix” is loaded within it.

The Nixpkgs source code, for example, has a =default.nix= file at its root, so
we can import a path directly to it

Here's a small example that creates two files, one that imports the other:

#+begin_src sh :dir .. :results output :exports both
mkdir nix_example

echo '{ a = 3; }' > nix_example/set.nix
echo '(import ./set.nix).a' > nix_example/default.nix

nix eval --file ./nix_example
#+end_src

#+RESULTS:
: 3

We also see here use of the =--file= switch with =nix=. This is useful when an
expression is saved in a file.

* Org-mode Cleanup :noexport:

Cleans directory for run:

#+call: cleanup()
